from colorama import init, Fore, Style

init(autoreset=True)


BANNER_WIDTH = 88


def print_banner():
    cyberlab_logo = [
        " ██████╗██╗   ██╗██████╗ ███████╗██████╗ ██╗      █████╗ ██████╗ ",
        "██╔════╝╚██╗ ██╔╝██╔══██╗██╔════╝██╔══██╗██║     ██╔══██╗██╔══██╗",
        "██║      ╚████╔╝ ██████╔╝█████╗  ██████╔╝██║     ███████║██████╔╝",
        "██║       ╚██╔╝  ██╔══██╗██╔══╝  ██╔══██╗██║     ██╔══██║██╔══██╗",
        "╚██████╗   ██║   ██████╔╝███████╗██║  ██║███████╗██║  ██║██████╔╝",
        " ╚═════╝   ╚═╝   ╚═════╝ ╚══════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚═════╝ ",
    ]

    print(Fore.MAGENTA + "=" * BANNER_WIDTH)

    for line in cyberlab_logo:
        print(Fore.CYAN + Style.BRIGHT + line)

    print()
    print(Fore.YELLOW + Style.DIM + " " * 62 + "developed by Bor-Code")
    print(Fore.MAGENTA + "=" * BANNER_WIDTH)
    print(Fore.LIGHTGREEN_EX + "Authorized lab use and cybersecurity education only.")
    print()


def print_section_title(title):
    print()
    print(Fore.MAGENTA + "-" * BANNER_WIDTH)
    print(Fore.CYAN + Style.BRIGHT + title)
    print(Fore.MAGENTA + "-" * BANNER_WIDTH)